$(function () {
    function lis(o) {

        var str = '';
        str += `
			<li>
				<div class="title">
					${o.title}
				</div>
				<div class="item">
					<span class="red">总体特征：</span>
					<span>${o.zttz}</span>
				</div>
				<div class="item">
					<span>常见表现：</span>
					<span>${o.cjbx}</span>
				</div>
				<div class="item">
					<span>发病倾向：</span>
					<span>${o.fbqx}</span>
				</div>
				<div class="item">
					<span>对外界环境适应能力：</span>
					<span>${o.synl}</span>
				</div>
				<div class="item">
					<span  class="red">调理方案：</span><br>
					<span>建议使用“七味轻脚丸”之<span class="red">《${o.tlfa}》</span></span>
				</div>
				<div class="item">
					<span>产品疗效：</span>
					<span>${o.cplx}</span>
				</div>
			</li>

		`;
        return str;
    }

    var tzObj = {
        A: {
            title: '平和质',
            zttz: '阴阳气血调和，以体态适中、面色红润、精力充沛等为主要特征。',
            xttz: '体形匀称健壮。',
            cjbx: '面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，唇色红润，不易疲劳，精力充沛，耐受寒热，睡眠良好，胃纳佳，二便正常，舌色淡红，苔薄白，脉和缓有力。',
            cplx: '通经络活气血、去湿逐寒、消肿散结、回阳救逆、散寒止痛、暧宫补肾、杀菌除臭、改善睡眠、促进血液和淋巴循环、增强免疫力。',
            fbqx: '平素患病较少。',
            synl: '对自然环境和社会环境适应能力较强。',
            tlfa: '艾草没药丸'
        },
        B: {
            title: '气虚质',
            zttz: '元气不足，以疲乏、气短、自汗等气虚表现为主要特征。',
            xttz: '肌肉松软不实。',
            cjbx: '平素语音低弱，气短懒言，容易疲乏，精神不振，易出汗，舌淡红，舌边有齿痕，脉弱。',
            cplx: '解郁安神、惊悸失眠、心忧郁积、心悸气短、却痰止咳、调经止痛、痈肿疮毒、润燥滑肠、补中益气、和胃生津、四肢无力、活血化瘀等。',
            fbqx: '易患感冒、内脏下垂等病；病后康复缓慢。',
            synl: '不耐受风、寒、暑、湿邪。',
            tlfa: '红花黄精丸'
        },
        C: {
            title: '阳虚质',
            zttz: '阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。',
            xttz: '肌肉松软不实。',
            cjbx: '平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。',
            cplx: '解表散寒、除湿止痛、解毒消肿、风湿痹痛、肩背酸痛、头痛、燥湿化痰、消痞散结、胸闷、痰多口黏腻等症。',
            fbqx: '易患痰饮、肿胀、泄泻等病；感邪易从寒化。',
            synl: '耐夏不耐冬；易感风、寒、湿邪。',
            tlfa: '人参半夏丸'
        },
        D: {
            title: '阴虚质',
            zttz: '阴液亏少，以口燥咽干、手足心热等虚热表现为主要特征。',
            xttz: '体形偏瘦。',
            cjbx: '手足心热，口燥咽干，鼻微干，喜冷饮，大便干燥，舌红少津，脉细数。',
            cplx: '解郁安神、惊悸失眠、心忧郁积、心悸气短、却痰止咳、调经止痛、痈肿疮毒、润燥滑肠、补中益气、和胃生津、四肢无力、活血化瘀等。',
            fbqx: '易患虚劳、失精、不寐等病；感邪易从热化。',
            synl: '耐冬不耐夏；不耐受暑、热、燥邪。',
            tlfa: '红花黄精丸'
        },
        E: {
            title: '痰湿质',
            zttz: '痰湿凝聚，以形体肥胖、腹部肥满、口黏苔腻等痰湿表现为主要特征。',
            xttz: '体形肥胖，腹部肥满松软。',
            cjbx: '面部皮肤油脂较多，多汗且黏，胸闷，痰多，口黏腻或甜，喜食肥甘甜黏，苔腻，脉滑。',
            cplx: '解表散寒、除湿止痛、解毒消肿、风湿痹痛、肩背酸痛、头痛、燥湿化痰、消痞散结、胸闷、痰多口黏腻等症。',
            fbqx: '易患消渴、中风、胸痹等病。',
            synl: '对梅雨季节及湿重环境适应能力差。',
            tlfa: '人参半夏丸'
        },
        F: {
            title: '湿热质',
            zttz: '湿热内蕴，以面垢油光、口苦、苔黄腻等湿热表现为主要特征。',
            xttz: '形体中等或偏瘦。',
            cjbx: '面垢油光，易生痤疮，口苦口干，身重困倦，大便黏滞不畅或燥结，小便短黄，男性易阴囊潮湿，女性易带下增多，舌质偏红，苔黄腻，脉滑数。',
            cplx: '通经络活气血、去湿逐寒、消肿散结、回阳救逆、散寒止痛、暧宫补肾、杀菌除臭、改善睡眠、促进血液和淋巴循环、增强免疫力。',
            fbqx: '易患疮疖、黄疸、热淋等病。',
            synl: '对夏末秋初湿热气候，湿重或气温偏高环境较难适应。',
            tlfa: '艾草没药丸'
        },
        G: {
            title: '血瘀质',
            zttz: '血行不畅，以肤色晦暗、舌质紫黯等血瘀表现为主要特征。',
            xttz: '胖瘦均见。',
            cjbx: '肤色晦暗，色素沉着，容易出现瘀斑，口唇黯淡，舌黯或有瘀点，舌下络脉紫黯或增粗，脉涩。',
            cplx: '散瘀止血、消肿定痛、祛风除湿、温经止痛、关节疼痛、行气活血、消肿生肌、跌打损伤、胸痹心痛、调经止痛、润燥滑肠等症。',
            fbqx: '易患癥瘕及痛证、血证等。',
            synl: '不耐受寒邪。',
            tlfa: '三七乳香丸'
        },
        H: {
            title: '气郁质',
            zttz: '气机郁滞，以神情抑郁、忧虑脆弱等气郁表现为主要特征。',
            xttz: '形体瘦者为多。',
            cjbx: '神情抑郁，情感脆弱，烦闷不乐，舌淡红，苔薄白，脉弦。',
            cplx: '解郁安神、惊悸失眠、心忧郁积、心悸气短、却痰止咳、调经止痛、痈肿疮毒、润燥滑肠、补中益气、和胃生津、四肢无力、活血化瘀等。',
            fbqx: '易患脏躁、梅核气、百合病及郁证等。',
            synl: '对精神刺激适应能力较差；不适应阴雨天气。',
            tlfa: '红花黄精丸'
        },
        I: {
            title: '特禀质',
            zttz: '先天失常，以生理缺陷、过敏反应等为主要特征。',
            xttz: '过敏体质者一般无特殊；先天禀赋异常者或有畸形，或有生理缺陷。',
            cjbx: '过敏体质者常见哮喘、风团、咽痒、鼻塞、喷嚏等；患遗传性疾病者有垂直遗传、先天性、家族性特征；患胎传性疾病者具有母体影响胎儿个体生长发育及相关疾病特征。',
            cplx: '通经络活气血、去湿逐寒、消肿散结、回阳救逆、散寒止痛、暧宫补肾、杀菌除臭、改善睡眠、促进血液和淋巴循环、增强免疫力。',
            fbqx: '过敏体质者易患哮喘、荨麻疹、花粉症及药物过敏等；遗传疾病如血友病、先天愚型等；胎传疾病如五迟（立迟、行迟、发迟、齿迟和语迟）、五软（头软、项软、手足软、肌肉软、口软）、解颅、胎惊、胎痫等。',
            synl: '适应能力差，如过敏体质者对易致敏季节适应能力差，易引发宿疾。',
            tlfa: '艾草没药丸'
        }
    }
    var str = location.search;
    str = str.slice(str.indexOf('?') + 1);
    console.log(str)
    // if(!str){
    // 	str='main=aATScore'
    // }
    var obj = {};
    var text = ''
    for (var i = 0; i < str.split('&').length; i++) {
        obj[str.split('&')[i].split('=')[0]] = str.split('&')[i].split('=')[1]
    }
    var font1 = '';
    var font2 = '';
    var font3 = '';
    if (obj.main.charAt(0) == 'a') {
        font1 = '是'
    } else if (obj.main.charAt(0) == 'b') {
        font1 = '基本是'
    }
    $('.top').text(font1 + tzObj[obj.main.charAt(1)].title);
    text += lis(tzObj[obj.main.charAt(1)])

    if (obj.sub) {
        font2 = ',有'
        if (obj.sub.charAt(0) == 'c') {
            font3 = '倾向'
        }
        $('.top').text(font1 + tzObj[obj.main.charAt(1)].title + font2 + tzObj[obj.sub.charAt(1)].title + font3)
        text += lis(tzObj[obj.sub.charAt(1)])
    }
    text += `
		<div class="code">
			<div class="codeImg">
				<img src="images/logo.jpg" alt="泰益生经络理疗馆">
		        <!--<p class="red">泰益生经络理疗馆</p>-->
			</div>
		</div>
	`

    $('ul').html(text)
})